tutorials/multiRegion/CHT/hotWire/constant/solid/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidElectricalConduction
{
    type        solidElectricalConduction;

    /*
    // Constant electrical conductivity
    sigma       3.55e7 [(A/m^2)/(V/m)];
    */

    // Temperature-dependent electrical conductivity
    sigma
    {
        type        fieldFunction;
        field       T;
        function
        {
            type        polynomial;
            coeffs      (7.61e7 -1.38e5);
        }
    }

    writeSigma  yes;
}

//************************************************************************** //
